Автоматизация документооборота/Documents/АктВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктВыполненныхРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаЧаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Автоматизация документооборота/Documents/АктВыполненныхРабот/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеАктаИзБазы(Данные, СсылкаНаОрг, СсылкаНаСотр)
	
	// Читаем название организации и директора
	Если ЗначениеЗаполнено(СсылкаНаОрг) Тогда
		Данные.Вставить("НазваниеОрганизации", СсылкаНаОрг.Наименование);
		Данные.Вставить("Директор", СсылкаНаОрг.Директор);
	Иначе
		Данные.Вставить("НазваниеОрганизации", "[Компания не выбрана]");
		Данные.Вставить("Директор", "");
	КонецЕсли;
	
	// Читаем ФИО сотрудника
	Если ЗначениеЗаполнено(СсылкаНаСотр) Тогда
		Данные.Вставить("ФИО", СсылкаНаСотр.Наименование); 
	Иначе
		Данные.Вставить("ФИО", "[Сотрудник не выбран]");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СократитьФИО(ПолноеФИО)
	
	Части = СтрРазделить(ПолноеФИО, " ", Ложь);
	Если Части.Количество() < 2 Тогда
		Возврат ПолноеФИО;
	КонецЕсли;
	
	Результат = Части[0];
	Результат = Результат + " " + Лев(Части[1], 1) + ".";
	Если Части.Количество() > 2 Тогда
		Результат = Результат + Лев(Части[2], 1) + ".";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СклонениеВРодительномФИО(ФИО)
	
	Части = СтрРазделить(ФИО, " ", Ложь);
	Если Части.Количество() < 2 Тогда
		Возврат ФИО;
	КонецЕсли;
	
	// Пол определяем по отчеству: -вич/-ич - мужской род
	Мужчина = Ложь;
	Если Части.Количество() > 2 И Прав(Части[2], 2) = "ич" Тогда
		Мужчина = Истина;
	КонецЕсли;
	
	Результат = СклонениеФамилии(Части[0], Мужчина) + " " + СклонениеИмени(Части[1], Мужчина);
	Если Части.Количество() > 2 Тогда
		Результат = Результат + " " + СклонениеОтчества(Части[2], Мужчина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СклонениеФамилии(Фамилия, Мужчина)
	
	Если СтрДлина(Фамилия) = 0 Тогда
		Возврат Фамилия;
	КонецЕсли;
	
	Длина = СтрДлина(Фамилия);
	Последний = Прав(Фамилия, 1);
	
	Если Не Мужчина Тогда
		Если Последний = "а" Тогда
			Возврат Лев(Фамилия, Длина - 1) + "ой";
		ИначеЕсли Последний = "я" Тогда
			Возврат Лев(Фамилия, Длина - 1) + "ей";
		КонецЕсли;
		Возврат Фамилия;
	КонецЕсли;
	
	Если Последний = "ь" Тогда
		Возврат Лев(Фамилия, Длина - 1) + "я";
	ИначеЕсли Последний = "й" Тогда
		Возврат Лев(Фамилия, Длина - 1) + "я";
	ИначеЕсли Последний = "а" ИЛИ Последний = "я" ИЛИ Последний = "о" ИЛИ Последний = "е" ИЛИ Последний = "у" ИЛИ Последний = "и" Тогда
		Возврат Фамилия;
	КонецЕсли;
	
	Возврат Фамилия + "а";
	
КонецФункции

&НаСервереБезКонтекста
Функция СклонениеИмени(Имя, Мужчина)
	
	Если СтрДлина(Имя) = 0 Тогда
		Возврат Имя;
	КонецЕсли;
	
	Длина = СтрДлина(Имя);
	Последний = Прав(Имя, 1);
	
	Если Мужчина Тогда
		Если Последний = "й" Тогда
			Возврат Лев(Имя, Длина - 1) + "я";
		ИначеЕсли Последний = "ь" Тогда
			Возврат Лев(Имя, Длина - 1) + "я";
		ИначеЕсли Последний = "а" ИЛИ Последний = "я" Тогда
			Возврат Имя;
		КонецЕсли;
		Возврат Имя + "а";
	КонецЕсли;
	
	Если Последний = "я" Тогда
		Возврат Лев(Имя, Длина - 1) + "и";
	ИначеЕсли Последний = "а" Тогда
		Возврат Лев(Имя, Длина - 1) + "ы";
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

&НаСервереБезКонтекста
Функция СклонениеОтчества(Отчество, Мужчина)
	
	Если СтрДлина(Отчество) = 0 Тогда
		Возврат Отчество;
	КонецЕсли;
	
	Если Мужчина Тогда
		Если Прав(Отчество, 1) = "ч" Тогда
			Возврат Отчество + "а";
		КонецЕсли;
		Возврат Отчество;
	КонецЕсли;
	
	Если Прав(Отчество, 1) = "а" Тогда
		Возврат Лев(Отчество, СтрДлина(Отчество) - 1) + "ы";
	КонецЕсли;
	
	Возврат Отчество;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПериодТекстПрописью(ДатаПериода)
	
	Месяцы = Новый Массив;
	Месяцы.Добавить("");
	Месяцы.Добавить("январь");
	Месяцы.Добавить("февраль");
	Месяцы.Добавить("март");
	Месяцы.Добавить("апрель");
	Месяцы.Добавить("май");
	Месяцы.Добавить("июнь");
	Месяцы.Добавить("июль");
	Месяцы.Добавить("август");
	Месяцы.Добавить("сентябрь");
	Месяцы.Добавить("октябрь");
	Месяцы.Добавить("ноябрь");
	Месяцы.Добавить("декабрь");
	
	НомерМесяца = Месяц(ДатаПериода);
	Если НомерМесяца = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Месяцы[НомерМесяца] + " " + Формат(ДатаПериода, "ДФ=yyyy") + " года";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрописатьТриаду(ЧислоТриады, Единицы, Поддесятки, Десятки, Сотни)
	
	Результат = "";
	
	СотниЦифра = Цел(ЧислоТриады / 100);
	Остаток = ЧислоТриады - СотниЦифра * 100;
	
	Если СотниЦифра > 0 Тогда
		Результат = Результат + Сотни[СотниЦифра] + " ";
	КонецЕсли;
	
	Если Остаток >= 10 И Остаток <= 19 Тогда
		Результат = Результат + Поддесятки[Остаток] + " ";
	Иначе
		ДесяткиЦифра = Цел(Остаток / 10);
		ЕдиницыЦифра = Остаток - ДесяткиЦифра * 10;
		Если ДесяткиЦифра > 0 Тогда
			Результат = Результат + Десятки[ДесяткиЦифра] + " ";
		КонецЕсли;
		Если ЕдиницыЦифра > 0 Тогда
			Результат = Результат + Единицы[ЕдиницыЦифра] + " ";
		КонецЕсли;
	КонецЕсли;
	
	Возврат СокрЛП(Результат);
	
КонецФункции

&НаСервереБезКонтекста
Функция СловоТысяч(Число)
	
	Остаток = Число - Цел(Число / 100) * 100;
	Если Остаток >= 11 И Остаток <= 14 Тогда
		Возврат "тысяч";
	КонецЕсли;
	
	Последняя = Число - Цел(Число / 10) * 10;
	Если Последняя = 1 Тогда
		Возврат "тысяча";
	ИначеЕсли Последняя >= 2 И Последняя <= 4 Тогда
		Возврат "тысячи";
	Иначе
		Возврат "тысяч";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СловоМиллионов(Число)
	
	Остаток = Число - Цел(Число / 100) * 100;
	Если Остаток >= 11 И Остаток <= 14 Тогда
		Возврат "миллионов";
	КонецЕсли;
	
	Последняя = Число - Цел(Число / 10) * 10;
	Если Последняя = 1 Тогда
		Возврат "миллион";
	ИначеЕсли Последняя >= 2 И Последняя <= 4 Тогда
		Возврат "миллиона";
	Иначе
		Возврат "миллионов";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СловоМиллиардов(Число)
	
	Остаток = Число - Цел(Число / 100) * 100;
	Если Остаток >= 11 И Остаток <= 14 Тогда
		Возврат "миллиардов";
	КонецЕсли;
	
	Последняя = Число - Цел(Число / 10) * 10;
	Если Последняя = 1 Тогда
		Возврат "миллиард";
	ИначеЕсли Последняя >= 2 И Последняя <= 4 Тогда
		Возврат "миллиарда";
	Иначе
		Возврат "миллиардов";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЧислоПрописьюСуммы(ЧислодляПрописи)
	
	ЧислодляПрописи = Цел(ЧислодляПрописи);
	Если ЧислодляПрописи = 0 Тогда
		Возврат "Ноль";
	КонецЕсли;
	
	Отрицательное = Ложь;
	Если ЧислодляПрописи < 0 Тогда
		Отрицательное = Истина;
		ЧислодляПрописи = -ЧислодляПрописи;
	КонецЕсли;
	
	ЕдиницыМ = Новый Массив;
	ЕдиницыМ.Добавить("");
	ЕдиницыМ.Добавить("один");
	ЕдиницыМ.Добавить("два");
	ЕдиницыМ.Добавить("три");
	ЕдиницыМ.Добавить("четыре");
	ЕдиницыМ.Добавить("пять");
	ЕдиницыМ.Добавить("шесть");
	ЕдиницыМ.Добавить("семь");
	ЕдиницыМ.Добавить("восемь");
	ЕдиницыМ.Добавить("девять");
	
	ЕдиницыЖ = Новый Массив;
	ЕдиницыЖ.Добавить("");
	ЕдиницыЖ.Добавить("одна");
	ЕдиницыЖ.Добавить("две");
	ЕдиницыЖ.Добавить("три");
	ЕдиницыЖ.Добавить("четыре");
	ЕдиницыЖ.Добавить("пять");
	ЕдиницыЖ.Добавить("шесть");
	ЕдиницыЖ.Добавить("семь");
	ЕдиницыЖ.Добавить("восемь");
	ЕдиницыЖ.Добавить("девять");
	
	Поддесятки = Новый Массив;
	Поддесятки.Добавить("");
	Поддесятки.Добавить("десять");
	Поддесятки.Добавить("одиннадцать");
	Поддесятки.Добавить("двенадцать");
	Поддесятки.Добавить("тринадцать");
	Поддесятки.Добавить("четырнадцать");
	Поддесятки.Добавить("пятнадцать");
	Поддесятки.Добавить("шестнадцать");
	Поддесятки.Добавить("семнадцать");
	Поддесятки.Добавить("восемнадцать");
	Поддесятки.Добавить("девятнадцать");
	
	Десятки = Новый Массив;
	Десятки.Добавить("");
	Десятки.Добавить("");
	Десятки.Добавить("двадцать");
	Десятки.Добавить("тридцать");
	Десятки.Добавить("сорок");
	Десятки.Добавить("пятьдесят");
	Десятки.Добавить("шестьдесят");
	Десятки.Добавить("семьдесят");
	Десятки.Добавить("восемьдесят");
	Десятки.Добавить("девяносто");
	
	Сотни = Новый Массив;
	Сотни.Добавить("");
	Сотни.Добавить("сто");
	Сотни.Добавить("двести");
	Сотни.Добавить("триста");
	Сотни.Добавить("четыреста");
	Сотни.Добавить("пятьсот");
	Сотни.Добавить("шестьсот");
	Сотни.Добавить("семьсот");
	Сотни.Добавить("восемьсот");
	Сотни.Добавить("девятьсот");
	
	Результат = "";
	Если Отрицательное Тогда
		Результат = "минус ";
	КонецЕсли;
	
	Миллиарды = Цел(ЧислодляПрописи / 1000000000);
	Остаток = ЧислодляПрописи - Миллиарды * 1000000000;
	Миллионы = Цел(Остаток / 1000000);
	Остаток = Остаток - Миллионы * 1000000;
	Тысячи = Цел(Остаток / 1000);
	Остаток = Остаток - Тысячи * 1000;
	
	Если Миллиарды > 0 Тогда
		Результат = Результат + ПрописатьТриаду(Миллиарды, ЕдиницыМ, Поддесятки, Десятки, Сотни) + " " + СловоМиллиардов(Миллиарды) + " ";
	КонецЕсли;
	Если Миллионы > 0 Тогда
		Результат = Результат + ПрописатьТриаду(Миллионы, ЕдиницыМ, Поддесятки, Десятки, Сотни) + " " + СловоМиллионов(Миллионы) + " ";
	КонецЕсли;
	Если Тысячи > 0 Тогда
		Результат = Результат + ПрописатьТриаду(Тысячи, ЕдиницыЖ, Поддесятки, Десятки, Сотни) + " " + СловоТысяч(Тысячи) + " ";
	КонецЕсли;
	Если Остаток > 0 Тогда
		Результат = Результат + ПрописатьТриаду(Остаток, ЕдиницыМ, Поддесятки, Десятки, Сотни) + " ";
	КонецЕсли;
	
	Результат = СокрЛП(Результат);
	Возврат ВРег(Лев(Результат, 1)) + Сред(Результат, 2);
	
КонецФункции

&НаСервере
Функция СформироватьАктНаСервере(Данные)
	
	// 1. Получаем HTML-код напрямую из текстового макета документа 1С
	ТекстДокумента = Документы.АктВыполненныхРабот.ПолучитьМакет("ШаблонАктаHTML").ПолучитьТекст();
	
	// 2. Делаем замену маркеров в тексте HTML-шаблона Акта
	// Номер и дата берутся из договора между организацией и сотрудником
	Если ЗначениеЗаполнено(Данные.Договор) Тогда
		НомерДоговора = Данные.Договор.НомерДоговора;
		ДатаДоговора = Формат(Данные.Договор.ДатаДоговора, "ДФ=dd.MM.yyyy");
	Иначе
		НомерДоговора = "[Договор не выбран]";
		ДатаДоговора = "";
	КонецЕсли;
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[НомерДоговора]", НомерДоговора);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ДатаДоговора]", ДатаДоговора);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[НомерАкта]", Данные.НомерАкта);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ДатаАкта]", Формат(Данные.ДатаАкта, "ДФ=dd.MM.yyyy"));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[НазваниеОрганизации]", ВРег(Данные.НазваниеОрганизации));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[Директор]", СклонениеВРодительномФИО(Данные.Директор));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ДиректорСокращенно]", СократитьФИО(Данные.Директор));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ФИО]", Данные.ФИО);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ФИОСокращенно]", СократитьФИО(Данные.ФИО));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ПериодТекст]", ПериодТекстПрописью(Данные.ПериодНачало));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[КоличествоЧасов]", Строка(Данные.КоличествоЧасов));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[СтавкаЧаса]", Строка(Данные.СтавкаЧаса));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ИтоговаяСумма]", Строка(Данные.ИтоговаяСумма));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[СуммаПрописью]", ЧислоПрописьюСуммы(Данные.ИтоговаяСумма));
	
	// 3. Записываем готовый файл во внутреннюю временную папку НА СЕРВЕРЕ
	ПутьКФайлу = КаталогВременныхФайлов() + "akt_preview.html";
	Запись = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	Запись.Записать(ТекстДокумента);
	Запись.Закрыть();
	
	// 4. Считываем собранный текст обратно в память программы
	Чтение = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ИтоговыйHTML = Чтение.Прочитать();
	Чтение.Закрыть();
	
	// 5. НА СЕРВЕРЕ мгновенно удаляем временный файл. На жестком диске чисто!
	УдалитьФайлы(ПутьКФайлу);
	
	Возврат ИтоговыйHTML;
	
КонецФункции

&НаКлиенте
Процедура ПросмотрПечати(Команда)
	
	Данные = Новый Структура;
	Данные.Вставить("НомерАкта", Объект.Номер);
	Данные.Вставить("ДатаАкта", Объект.Дата);
	Данные.Вставить("ПериодНачало", Объект.ПериодНачало);
	Данные.Вставить("ПериодКонец", Объект.ПериодКонец);
	Данные.Вставить("КоличествоЧасов", Объект.КоличествоЧасов);
	Данные.Вставить("СтавкаЧаса", Объект.СтавкаЧаса);
	Данные.Вставить("ИтоговаяСумма", Объект.ИтоговаяСумма);
	Данные.Вставить("Договор", Объект.Договор);
	
	// Считываем текстовые поля из связанных карточек на сервере
	ЗаполнитьДанныеАктаИзБазы(Данные, Объект.Организация, Объект.Сотрудник);
	
	Попытка
		// Вызываем безопасную серверную функцию и сразу выводим HTML-текст в окно на экране
		ЭтаФорма.ТекстАктаДляПросмотра = СформироватьАктНаСервере(Данные);
	Исключение
		ПоказатьПредупреждение(, "Ошибка создания акта: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Логика мгновенного автоматического расчета суммы (Часы х Ставка) при вводе чисел
&НаКлиЕнте
Процедура КоличествоЧасовПриИзменении(Элемент)
	РассчитатьСуммуАкта();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаЧасаПриИзменении(Элемент)
	РассчитатьСуммуАкта();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуАкта()
	Объект.ИтоговаяСумма = Объект.КоличествоЧасов * Объект.СтавкаЧаса;
КонецПроцедуры
